tutorials/incompressible/simpleFoam/pitzDailyExptInlet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        setAverage      0;
        offset          0;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
